national-parks-backend/app/controllers/national_parks_controller.rb

SELECT "national_parks".* FROM "national_parks"
---
  def index
    nationalparks = NationalPark.all

SELECT  "national_parks".* FROM "national_parks" WHERE "national_parks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    nationalpark = NationalPark.find_by(id: params[:id])

INSERT INTO "national_parks" ("name", "description", "image_url") VALUES ($1, $2, $3) RETURNING "id"  [["name", "practice park "], ["description", "dk;dfja;dj"], ["image_url", "no image "]]
---
  def create
    name = params[:name]
    image = params[:image]
    description = params[:description]
    park = NationalPark.new(name: name, image_url: image, description: description)
    if park.save