national-parks-backend/app/controllers/reviews_controller.rb

SELECT  "national_parks".* FROM "national_parks" WHERE "national_parks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("content", "national_park_id", "author") VALUES ($1, $2, $3) RETURNING "id"  [["content", "I'll come back every weekend for the rest of my life!!!!!!!!!!!"], ["national_park_id", 2], ["author", "Pat"]]
---
  def create
    nationalpark = NationalPark.find(params[:national_park_id])
    content = params[:review][:content]
    author = params[:review][:author]
    review = Review.new(content: content, author: author, national_park_id: nationalpark.id)
    if review.save

DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 10]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def destroy
    render json: Review.find(params[:id]).destroy